# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\PC\Desktop\WorkspaceLab10.cydsn\Blank-20240329T070651Z-001\Blank\Psoc6E-INK DISPLAY.cydsn\Psoc6E-INK DISPLAY.cyprj
# Date: Sun, 04 May 2025 17:27:32 GMT
#set_units -time ns
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyClk_LF} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyFLL} -period 10 -waveform {0 5} [list [get_pins {ClockBlock/fll}]]
create_clock -name {CyClk_HF0} -period 10 -waveform {0 5} [list [get_pins {ClockBlock/hfclk_0}]]
create_clock -name {CyClk_Fast} -period 10 -waveform {0 5} [list [get_pins {ClockBlock/fastclk}]]
create_clock -name {CyClk_Peri} -period 20 -waveform {0 10} [list [get_pins {ClockBlock/periclk}]]
create_generated_clock -name {CyClk_Slow} -source [get_pins {ClockBlock/periclk}] -edges {1 2 3} [list [get_pins {ClockBlock/slowclk}]]
create_generated_clock -name {EINK_Clock} -source [get_pins {ClockBlock/periclk}] -edges {1 25001 50001} [list [get_pins {ClockBlock/ff_div_11}]]
create_generated_clock -name {CY_EINK_SPIM_SCBCLK} -source [get_pins {ClockBlock/periclk}] -edges {1 2 3} [list [get_pins {ClockBlock/ff_div_6}]]
create_clock -name {CyPeriClk_App} -period 20 -waveform {0 10} [list [get_pins {ClockBlock/periclk_App}]]
create_clock -name {CyIMO} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/imo}]]


# Component constraints for C:\Users\PC\Desktop\WorkspaceLab10.cydsn\Blank-20240329T070651Z-001\Blank\Psoc6E-INK DISPLAY.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\PC\Desktop\WorkspaceLab10.cydsn\Blank-20240329T070651Z-001\Blank\Psoc6E-INK DISPLAY.cydsn\Psoc6E-INK DISPLAY.cyprj
# Date: Sun, 04 May 2025 17:27:05 GMT
